[M_Aster_RaidBoss MissionDefinition]
MissionName="Raiders is the final boss"
MissionDescription="The raid leader, Mr. Darkness, is visible somewhere in the forest of this enchanted land. If you're brave and have three friends (or really tough), you might be strong enough to kill the boss and get the reward.."
TurnInDescription="Money, gold, and blood! This is the life of looking for a camera!!"
MissionSummary="Defeat dangerous raid bosses."
MissionGiver="Mr. Torg"
MissionTurnInLocation="Mr Tork"
TeaserText="Disaster awaits you and your friends."

[M_Aster_RaidBoss:KillRaidBoss MissionObjectiveDefinition]
ProgressMessage="Slay the dragon"

[M_Aster_RaidBoss:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_RaidBoss:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_RaidBoss:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Aster_RaidBoss:SummonCreature MissionObjectiveDefinition]
ProgressMessage="The bell dragon"

[M_Aster_RaidBoss:UseSecretStatue MissionObjectiveDefinition]
ProgressMessage="now!"

